Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalElementsInvalidAfterUpgrade Property
 One or several analytical elements have become invalid during the upgrade process and will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalElementsInvalidAfterUpgrade { get; }
Public Shared ReadOnly Property AnalyticalElementsInvalidAfterUpgrade As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalElementsInvalidAfterUpgrade {
	FailureDefinitionId^ get ();
}
static member AnalyticalElementsInvalidAfterUpgrade : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace